app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 3]]
---
  def index
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
        if @artist.nil?
          flash[:alert] = "Artist not found."
          redirect_to artists_path
        else
          @songs = @artist.songs
        end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 10], ["LIMIT", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find_by(params[:artist_id])
      @song = @artist.songs.find_by_id(params[:id])

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "This is atitle"], ["created_at", "2021-01-10 02:54:19.381795"], ["updated_at", "2021-01-10 02:54:19.381795"], ["artist_id", 5]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def edit
    @song = Song.find(params[:id])